app/controllers/comments_controller.rb

  def create
    @people = People.find(params[:person_id])
    @comment = @people.comments.create(params[:comment])
---
SELECT `people`.* FROM `people` WHERE `people`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`body`, `commenter`, `created_at`, `people_id`, `updated_at`) VALUES ('sdfsdf', 'sdfsd', '2012-07-18 08:57:00', 1, '2012-07-18 08:57:00')