app/controllers/peoples_controller.rb

	def create
	  @people = People.new(params[:people])
	  if @people.save
---
INSERT INTO `people` (`created_at`, `description`, `firstname`, `secondname`, `updated_at`) VALUES ('2012-07-18 08:38:40', 'dsadsa', 'asd', 'asdsa', '2012-07-18 08:38:40')

	def show
	  @people = People.find(params[:id])
---
SELECT `peoples`.* FROM `peoples` WHERE `peoples`.`id` = 1 LIMIT 1

	def index
	  @peoples = People.all
---
SELECT `peoples`.* FROM `peoples`

	def edit
	  @people = People.find(params[:id])
---
SELECT `peoples`.* FROM `peoples` WHERE `peoples`.`id` = 12 LIMIT 1

	def update
	  @people = People.find(params[:id])
---
SELECT `peoples`.* FROM `peoples` WHERE `peoples`.`id` = 12 LIMIT 1

	def destroy
	  @people = People.find(params[:id])
	  @people.destroy
---
SELECT `peoples`.* FROM `peoples` WHERE `peoples`.`id` = 11 LIMIT 1
DELETE FROM `peoples` WHERE `peoples`.`id` = 11