app/views/peoples/show.html.erb

<h2>Comments</h2>
<% @people.comments.each do |comment| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`people_id` = 1